name: "tokenizer"
max_batch_size: 0
backend: "python"

input [
{
    name: "prompt"
    data_type: TYPE_STRING
    dims: [ -1 ]
}
]
output [
{
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [-1, -1]
},
{
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [-1, -1]
}
]
instance_group [
    {
      count: 1
      kind: KIND_GPU
    }
]


